/*
 * Test485.c
 *
 *  Created on: 2013-11-2
 *      Author: HIKE Tech
 */
#include "HK_all_include.h"



//#################################################
//初始化485的收发控制引脚
//
//-----------------------------------------------
void Init485EN()
{
	EALLOW;
		TEN485MUX = 0;
		TEN485DIR = 1;
	EDIS;
	TEN485OFF();     //------------------------发送完毕释放485总线-----------------------
}


//#################################################
//-----------------------------------------------
//启动485发送
//----------------------------------------------
void start485Send()
{
	TEN485ON();     //-------------------------发送前使能控制，占用485总线--------------------
}

//#################################################
//-----------------------------------------------
//等待485发送完毕
//判断移位寄存器为空TXEMPTY 
//----------------------------------------------
#define TIMEROUT485 (Uint16)10*(SYSCLK/SCIBaudRate)
void wait485Send()
{
	Uint32 WaitTimer=0;

	//while (SciaRegs.SCIFFTX.bit.TXFFST != 0)
	while(SciaRegs.SCICTL2.bit.TXEMPTY != 1)
	{
		WaitTimer++;
		if(WaitTimer > TIMEROUT485) break;
	}
//	while(WaitTimer < TIMEROUT485)
//		WaitTimer++;
	TEN485OFF();     //------------------------发送完毕释放485总线-----------------------
}


